#include "DSP28x_Project.h" 

//NTC 0-125度的阻值
Uint16 NTC10K[126]={
32116,30570,29105,27716,26399,25150,23965,22842,21776,20764,
19783,18892,18026,17204,16423,15681,14976,14306,13669,13063,
12487,11939,11418,10921,10449,10000,9571, 9164, 8775, 8405,
8052, 7716, 7396, 7090, 6798, 6520, 6255, 6002, 5760, 5529,
5309, 5098, 4897, 4704, 4521, 4345, 4177, 4016, 3863, 3716,
3588, 3440, 3311, 3188, 3069, 2956, 2848, 2744, 2644, 2548,
2457, 2369, 2284, 2204, 2126, 2051, 1980, 1911, 1845, 1782,
1721, 1663, 1606, 1552, 1500, 1450, 1402, 1356, 1312, 1269,
1228, 1188, 1150, 1113, 1078, 1044, 1011, 979,  948,  919,
891,  863,  837,  811,  787,  763,  740,  718,  697,  676,
657,  637,  619,  601,  584,  567,  551,  535,  520,  505,
491,  477,  464,  451,  439,  427,  415,  404,  393,  383,
373,  363,  353,  344,  335,  326
};

Uint16 Calc10KTmp(float32 iValue);
void itoa(int n,char s[]);
void float_TO_ascii(float a, char dat[8]);

//名    称：Calc10KTmp
//功    能：计算温度值 0度~125度(NTC=10K 25度)
//入口参数：采样阻值
//出口参数：温度值
Uint16 Calc10KTmp(float32 iValue)
{
	Uint16 i=25;
	if(iValue>=32116)
		i=0;
	else if(iValue<=326)
		i=125;
	else
	{
		//循环法查找
		//for(i=0;i<126;i++)
		//{
		//	if(iValue>=NTC10K[i]) break;
		//}
		//二分法查找
		while((iValue>=NTC10K[i]||iValue<=NTC10K[i+1]))
		{
			if(iValue>=NTC10K[i])
			{
				i--;
			}
			else
			{
				i++;
			}
		}
	}
	return(i);
}

//将整数n这个数字转换为对应的字符串，保存到s中
void itoa(int n,char s[])  
{
     int i = 0;  
     int left = 0;  
     int right = 0;  
     while( n )       					//将数字转换为字符  
     {  
        s[i] = n % 10 + '0';  
        n /= 10;  
        i++;         					//left已经向后移位  
     }  
     right = i - 1;  
     s[i] = '\0';        				//添加字符串结束标志  
     while(left < right)    			//将数组中的元素逆置  
     {  
         char tmp = s[left];  
         s[left] = s[right];  
         s[right] = tmp;  
         left++;  
         right--;  
      }  
}  

//将浮点数处理为ASCII码
//6位有效数字，这里为了整齐 如：0.01234当作6位有效数字
void float_TO_ascii(float a, char dat[8])
{
        if(1000<=a&&a<10000)
        {
                dat[0] = (int)a%10000/1000 + 0x30;
                dat[1] = (int)a%1000/100 + 0x30;
                dat[2] = (int)a%100/10 + 0x30;
                dat[3] = (int)a%10 + 0x30;
                dat[4] = 0x2e;
                dat[5] = (int)(a*10)%10 + 0x30;
                dat[6] = (int)(a*100)%10 + 0x30;
                dat[7] = 0;
        }
        if(100<=a&&a<1000)
        {
                dat[0] = (int)a%1000/100 + 0x30;
                dat[1] = (int)a%100/10 + 0x30;
                dat[2] = (int)a%10 + 0x30;
                dat[3] = 0x2e;
                dat[4] = (int)(a*10)%10 + 0x30;
                dat[5] = (int)(a*100)%10 + 0x30;
                dat[6] = (int)(a*1000)%10 + 0x30;
                dat[7] = (int)(a*10000)%10 + 0x30;
        }
        if(10<=a&&a<100)
        {
                dat[0] = (int)a%100/10 + 0x30;
                dat[1] = (int)a%10 + 0x30;
                dat[2] = 0x2e;
                dat[3] = (int)(a*10)%10 + 0x30;
                dat[4] = (int)(a*100)%10 + 0x30;
                dat[5] = (int)(a*1000)%10 + 0x30;
                dat[6] = (int)(a*10000)%10 + 0x30;
                dat[7] = (int)(a*100000)%10 + 0x30;
        }
        if(1<=a&&a<10)
        {
                dat[0] = (int)a%10 + 0x30;
                dat[1] = 0x2e;
                dat[2] = (int)(a*10)%10 + 0x30;
                dat[3] = (int)(a*100)%10 + 0x30;
                dat[4] = (int)(a*1000)%10 + 0x30;
                dat[5] = (int)(a*10000)%10 + 0x30;
                dat[6] = (int)(a*100000)%10 + 0x30;
                dat[7] = 0;
        }
        if(0<=a&&a<1)
        {
                dat[0] = 0x30;
                dat[1] = 0x2e;
                dat[2] = (int)(a*10)%10 + 0x30;
                dat[3] = (int)(a*100)%10 + 0x30;
                dat[4] = (int)(a*1000)%10 + 0x30;
                dat[5] = (int)(a*10000)%10 + 0x30;
                dat[6] = (int)(a*100000)%10 + 0x30;
                dat[7] = 0;
        }
        if(-1<a&&a<0)
        {
                dat[0] = 0x2d;
                dat[1] = 0x30;
                dat[2] = 0x2e ;
                dat[3] = (int)(-a*10)%10 + 0x30;
                dat[4] = (int)(-a*100)%10 + 0x30;
                dat[5] = (int)(-a*1000)%10 + 0x30;
                dat[6] = (int)(-a*10000)%10 + 0x30;
                dat[7] = (int)(-a*100000)%10 + 0x30;
        }
        if(-10<a&&a<=-1)
        {
                dat[0] = 0x2d;
                dat[1] = (int)(-a)%10 + 0x30;
                dat[2] = 0x2e ;
                dat[3] = (int)(-a*10)%10 + 0x30;
                dat[4] = (int)(-a*100)%10 + 0x30;
                dat[5] = (int)(-a*1000)%10 + 0x30;
                dat[6] = (int)(-a*10000)%10 + 0x30;
                dat[7] = (int)(-a*100000)%10 + 0x30;
        }
        if(-100<a&&a<=-10)
        {
                dat[0] = 0x2d;
                dat[1] = (int)(-a)%100/10 + 0x30;
                dat[2] = (int)(-a)%10 + 0x30;
                dat[3] = 0x2e ;
                dat[4] = (int)(-a*10)%10 + 0x30;
                dat[5] = (int)(-a*100)%10 + 0x30;
                dat[6] = (int)(-a*1000)%10 + 0x30;
                dat[7] = (int)(-a*10000)%10 + 0x30;
        }
        if(-1000<a&&a<=-100)
        {
                dat[0] = 0x2d;
                dat[1] = (int)(-a)%1000/100 + 0x30;
                dat[2] = (int)(-a)%100/10 + 0x30;
                dat[3] = (int)(-a)%10 + 0x30;
                dat[4] = 0x2e ;
                dat[5] = (int)(-a*10)%10 + 0x30;
                dat[6] = (int)(-a*100)%10 + 0x30;
                dat[7] = (int)(-a*1000)%10 + 0x30;
        }
        if(-10000<a&&a<=-1000)
        {
                dat[0] = 0x2d;
                dat[1] = (int)(-a)%10000/1000 + 0x30;
                dat[2] = (int)(-a)%1000/100 + 0x30;
                dat[3] = (int)(-a)%100/10 + 0x30;
                dat[4] = (int)(-a)%10 + 0x30;
                dat[5] = 0x2e ;
                dat[6] = (int)(-a*10)%10 + 0x30;
                dat[7] = (int)(-a*100)%10 + 0x30;
        }
}
