//============================================================================================
//KPIDF.h
//KPID 微积分增量式PID算法
//kypine QQ:190459556
//2017.12.16
//============================================================================================

/***********************************************************************************************************
 一、 位置式PID控制与增量式PID控制的比较：
	（1）位置式PID控制的输出与整个过去的状态有关，用到了误差的累加值；而增量式PID的输出只与当前拍和前两拍的误差有关，因此位置式PID控制
的累积误差相对更大；
	（2）增量式PID控制输出的是控制量增量，并无积分作用，因此该方法适用于执行机构带积分部件的对象，如步进电机等，而位置式PID适用于执行机
构不带积分部件的对象，如电液伺服阀。
	（3）由于增量式PID输出的是控制量增量，如果计算机出现故障，误动作影响较小，而执行机构本身有记忆功能，可仍保持原位，不会严重影响系统的
工作，而位置式的输出直接对应对象的输出，因此对系统影响较大。

二、PID参数确定调节四项原则
	PID控制器参数选择的方法很多，例如试凑法、临界比例度法、扩充临界比例度法等。但是，对于PID控制而言，参数的选择始终是一件非常烦杂的工作，
需要经过不断的调整才能得到较为满意的控制效果。依据经验，一般PID参数确定的步骤如下：
	(1)确定比例系数Kp
	确定比例系数Kp时，首先去掉PID的积分项和微分项，可以令Ki=0、Kd=0，使之成为纯比例调节。输入设定为系统允许输出最大值的60％～70％，比例
系数Kp由0开始逐渐增大，直至系统出现振荡；再反过来，从此时的比例系数Kp逐渐减小，直至系统振荡消失。记录此时的比例系数Kp，设定PID的比例系数Kp
为当前值的60％～70％。
	(2)确定积分时间常数Ki
	比例系数Kp确定之后，设定一个较大的积分时间常数Ki，然后逐渐减小Ki，直至系统出现振荡，然后再反过来，逐渐增大Ki，直至系统振荡消失。记录
此时的Ki，设定PID的积分时间常数Ki为当前值的150％～180％。
	(3)确定微分时间常数Kd
	微分时间常数Kd一般不用设定，为0即可，此时PID调节转换为PI调节。如果需要设定，则与确定Kp的方法相同，取不振荡时其值的30％。
	(4)系统空载、带载联调
	对PID参数进行微调，直到满足性能要求。
三、PID 算法中Kp Ki Kd对系统性能的影响
	(1) 比例系数Kp对系统性能的影响
　　比例系数加大，使系统的动作灵敏，速度加快，稳态误差减小。Kp偏大，振荡次数加多，调节时间加长。Kp太大时，系统会趋于不稳定。Kp太小，又会
使系统的动作缓慢。Kp可以选负数，这主要是由执行机构、传感器以控制对象的特性决定的。如果Kp的符号选择不当对象状态(pv值)就会离控制目标的
状态(sv值)越来越远，如果出现这样的情况Kp的符号就一定要取反。
	(2) 积分控制Ki对系统性能的影响
　　积分作用使系统的稳定性下降，Ki小（积分作用强）会使系统不稳定，但能消除稳态误差，提高系统的控制精度。
	(3) 微分控制Kd对系统性能的影响
　　微分作用可以改善动态特性，Kd偏大时，超调量较大，调节时间较短。Kd偏小时，超调量也较大，调节时间也较长。只有Kd合适，才能使超调量较小，
减短调节时间。

	在一般的pid控制中，当有较大的扰动或大幅度改变给定值时，由于此时有较大的偏差，以及系统有惯性和滞后，故在积分项的作用下往往会产生较大的超调
和长时间的波动，为此，采用积分分离措施，即偏差较大时，取消积分作用，当偏差较小时，才采用积分作用
***********************************************************************************************************/

typedef struct {
    float Ref;       				//定义设定值
    float Fdbk;        				//定义AD采样实际值
    float Out;         				//定义增量值
    float err;         				//定义偏差值
    float err_next;         		//定义上一个偏差值
    float err_last;        			//定义最上前的偏差值
    float Kp,Ki,Kd;        			//定义比例、积分、微分系数
}kpid;

void PID_init(kpid*pid);
void PID_realize(kpid*pid);
